{"DEFAULT": {"undercloud_public_vip": "Virtual IP address to use for the public endpoints of Undercloud services.  Only used if undercloud_service_certficate is set.", "dhcp_start": "Start of DHCP allocation range for PXE and DHCP of Overcloud instances.", "local_mtu": "MTU to use for the local_interface.", "local_interface": "Network interface on the Undercloud that will be handling the PXE boots and DHCP for Overcloud instances.", "inspection_interface": "Network interface on which inspection dnsmasq will listen.  If in doubt, use the default value.", "enable_telemetry": "Whether to install Telemetry services (ceilometer, aodh) in the Undercloud.", "undercloud_admin_vip": "Virtual IP address to use for the admin endpoints of Undercloud services.  Only used if undercloud_service_certficate is set.", "hieradata_override": "Path to hieradata override file. If set, the file will be copied under /etc/puppet/hieradata and set as the first file in the hiera hierarchy. This can be used to to custom configure services beyond what undercloud.conf provides", "enable_zaqar": "Whether to install Zaqar services in the Undercloud.", "enable_mistral": "Whether to install Mistral services in the Undercloud.", "ipxe_deploy": "Whether to use iPXE for deploy by default.", "store_events": "Whether to store events in the Undercloud Ceilometer.", "undercloud_service_certificate": "Certificate file to use for OpenStack service SSL connections.  Setting this enables SSL for the OpenStack API endpoints, leaving it unset disables SSL.", "inspection_enable_uefi": "Whether to support introspection of nodes that haveUEFI-only firmware.", "enable_tempest": "Whether to install Tempest in the Undercloud.", "image_path": "Local file path to the necessary images. The path should be a directory readable by the current user that contains the full set of images.", "dhcp_end": "End of DHCP allocation range for PXE and DHCP of Overcloud instances.", "undercloud_debug": "Whether to enable the debug log level for Undercloud OpenStack services.", "undercloud_hostname": "Fully qualified hostname (including domain) to set on the Undercloud. If left unset, the current hostname will be used, but the user is responsible for configuring all system hostname settings appropriately.  If set, the undercloud install will configure all system hostname settings.", "clean_nodes": "Whether to clean overcloud nodes (wipe the hard drive) between deployments and after the introspection.", "network_cidr": "Network CIDR for the Neutron-managed network for Overcloud instances. This should be the subnet used for PXE booting.", "scheduler_max_attempts": "Maximum number of attempts the scheduler will make when deploying the instance. You should keep it greater or equal to the number of bare metal nodes you expect to deploy at once to work around potential race condition when scheduling.", "local_ip": "IP information for the interface on the Undercloud that will be handling the PXE boots and DHCP for Overcloud instances.  The IP portion of the value will be assigned to the network interface defined by local_interface, with the netmask defined by the prefix portion of the value.", "inspection_extras": "Whether to enable extra hardware collection during the inspection process. Requires python-hardware or python-hardware-detect package on the introspection image.", "enable_monitoring": "Whether to install Monitoring services in the Undercloud.", "masquerade_network": "Network that will be masqueraded for external access, if required. This should be the subnet used for PXE booting.", "generate_service_certificate": "When set to True, a self-signed SSL certificate will be generated as part of the undercloud install and this certificate will be used in place of the value for undercloud_service_certificate.  The resulting certificate will be written to ~/undercloud-[undercloud_public_vip].pem.  Note that this certificate will also be added to the system's trusted certificate store.", "network_gateway": "Network gateway for the Neutron-managed network for Overcloud instances. This should match the local_ip above when using masquerading.", "inspection_runbench": "Whether to run benchmarks when inspecting nodes. Requires inspection_extras set to True.", "inspection_iprange": "Temporary IP range that will be given to nodes during the inspection process.  Should not overlap with the range defined by dhcp_start and dhcp_end, but should be in the same network."}, "auth": {"undercloud_mistral_password": "Mistral service password. If left unset, one will be automatically generated.", "undercloud_ceilometer_snmpd_password": "Ceilometer snmpd password. If left unset, one will be automatically generated.", "undercloud_heat_encryption_key": "Heat db encryption key(must be 16, 24, or 32 characters. If left unset, one will be automatically generated.", "undercloud_swift_hash_suffix": "Swift hash suffix. If left unset, one will be automatically generated.", "undercloud_glance_password": "Glance service password. If left unset, one will be automatically generated.", "undercloud_admin_password": "Keystone admin password. If left unset, one will be automatically generated.", "undercloud_swift_password": "Swift service password. If left unset, one will be automatically generated.", "undercloud_aodh_password": "Aodh service password. If left unset, one will be automatically generated.", "undercloud_rabbit_username": "Rabbitmq username. If left unset, one will be automatically generated.", "undercloud_horizon_secret_key": "Horizon secret key. If left unset, one will be automatically generated.", "undercloud_heat_password": "Heat service password. If left unset, one will be automatically generated.", "undercloud_ironic_password": "Ironic service password. If left unset, one will be automatically generated.", "undercloud_zaqar_password": "Zaqar password. If left unset, one will be automatically generated.", "undercloud_ceilometer_password": "Ceilometer service password. If left unset, one will be automatically generated.", "undercloud_haproxy_stats_password": "HAProxy stats password. If left unset, one will be automatically generated.", "undercloud_heat_stack_domain_admin_password": "Heat stack domain admin password. If left unset, one will be automatically generated.", "undercloud_ceilometer_snmpd_user": "Ceilometer snmpd read-only user. If this value is changed from the default, the new value must be passed in the overcloud environment as the parameter SnmpdReadonlyUserName. This value must be between 1 and 32 characters long.", "undercloud_rabbit_password": "Rabbitmq password. If left unset, one will be automatically generated.", "undercloud_nova_password": "Nova service password. If left unset, one will be automatically generated.", "undercloud_neutron_password": "Neutron service password. If left unset, one will be automatically generated.", "undercloud_rabbit_cookie": "Rabbitmq cookie. If left unset, one will be automatically generated.", "undercloud_admin_token": "Keystone admin token. If left unset, one will be automatically generated.", "undercloud_db_password": "Password used for MySQL databases. If left unset, one will be automatically generated.", "undercloud_ceilometer_metering_secret": "Ceilometer metering secret. If left unset, one will be automatically generated.", "undercloud_sensu_password": "Sensu service password. If left unset, one will be automatically generated."}}